/* automatically generated by rust-bindgen 0.69.5 */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod __1 {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[repr(align(8))]
            #[derive(Debug, Copy, Clone)]
            pub struct mutex {
                pub _bindgen_opaque_blob: [u64; 8usize],
            }
            pub type mutex_native_handle_type = u64;
            #[test]
            fn bindgen_test_layout_mutex() {
                assert_eq!(
                    ::std::mem::size_of::<mutex>(),
                    64usize,
                    concat!("Size of: ", stringify!(mutex))
                );
                assert_eq!(
                    ::std::mem::align_of::<mutex>(),
                    8usize,
                    concat!("Alignment of ", stringify!(mutex))
                );
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__15mutex4lockEv"]
                pub fn mutex_lock(this: *mut root::std::__1::mutex);
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__15mutex8try_lockEv"]
                pub fn mutex_try_lock(this: *mut root::std::__1::mutex) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__15mutex6unlockEv"]
                pub fn mutex_unlock(this: *mut root::std::__1::mutex);
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__15mutexD1Ev"]
                pub fn mutex_mutex_destructor(this: *mut root::std::__1::mutex);
            }
            impl mutex {
                #[inline]
                pub unsafe fn lock(&mut self) {
                    mutex_lock(self)
                }
                #[inline]
                pub unsafe fn try_lock(&mut self) -> bool {
                    mutex_try_lock(self)
                }
                #[inline]
                pub unsafe fn unlock(&mut self) {
                    mutex_unlock(self)
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    mutex_mutex_destructor(self)
                }
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct unique_lock {
                pub _address: u8,
            }
            pub type unique_lock_mutex_type = u8;
            #[repr(C)]
            #[repr(align(8))]
            #[derive(Debug, Copy, Clone)]
            pub struct condition_variable {
                pub _bindgen_opaque_blob: [u64; 6usize],
            }
            pub type condition_variable_native_handle_type = u64;
            #[test]
            fn bindgen_test_layout_condition_variable() {
                assert_eq!(
                    ::std::mem::size_of::<condition_variable>(),
                    48usize,
                    concat!("Size of: ", stringify!(condition_variable))
                );
                assert_eq!(
                    ::std::mem::align_of::<condition_variable>(),
                    8usize,
                    concat!("Alignment of ", stringify!(condition_variable))
                );
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_oneEv"]
                pub fn condition_variable_notify_one(this: *mut root::std::__1::condition_variable);
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__118condition_variable10notify_allEv"]
                pub fn condition_variable_notify_all(this: *mut root::std::__1::condition_variable);
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__118condition_variable4waitERNS_11unique_lockINS_5mutexEEE"]
                pub fn condition_variable_wait(
                    this: *mut root::std::__1::condition_variable,
                    __lk: *mut [u64; 2usize],
                );
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__118condition_variableD1Ev"]
                pub fn condition_variable_condition_variable_destructor(
                    this: *mut root::std::__1::condition_variable,
                );
            }
            impl condition_variable {
                #[inline]
                pub unsafe fn notify_one(&mut self) {
                    condition_variable_notify_one(self)
                }
                #[inline]
                pub unsafe fn notify_all(&mut self) {
                    condition_variable_notify_all(self)
                }
                #[inline]
                pub unsafe fn wait(&mut self, __lk: *mut [u64; 2usize]) {
                    condition_variable_wait(self, __lk)
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    condition_variable_condition_variable_destructor(self)
                }
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct allocator {
                pub _address: u8,
            }
            pub type allocator_size_type = u64;
            pub type allocator_difference_type = u64;
            pub type allocator_value_type = u8;
            pub type allocator_propagate_on_container_move_assignment = u8;
            pub type allocator_is_always_equal = u8;
            pub type allocator_pointer = u8;
            pub type allocator_const_pointer = u8;
            pub type allocator_reference = u8;
            pub type allocator_const_reference = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct allocator_rebind {
                pub _address: u8,
            }
            pub type allocator_rebind_other = u8;
            pub mod __variant_detail {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct deque {
                pub _address: u8,
            }
            pub type deque_value_type = u8;
            pub type deque_allocator_type = u8;
            pub type deque___alloc_traits = u8;
            pub type deque_size_type = u8;
            pub type deque_difference_type = u8;
            pub type deque_pointer = u8;
            pub type deque_const_pointer = u8;
            pub type deque___pointer_allocator = u8;
            pub type deque___const_pointer_allocator = u8;
            pub type deque___map = u8;
            pub type deque___map_alloc_traits = u8;
            pub type deque___map_pointer = u8;
            pub type deque___map_const_pointer = u8;
            pub type deque___map_const_iterator = u8;
            pub type deque_reference = u8;
            pub type deque_const_reference = u8;
            pub type deque_iterator = u8;
            pub type deque_const_iterator = u8;
            pub type deque_reverse_iterator = u8;
            pub type deque_const_reverse_iterator = u8;
            pub type deque___trivially_relocatable = u8;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct deque___deque_block_range {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct deque___deque_range {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct deque__ConstructTransaction {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct deque__bindgen_ty_1 {
                pub _address: u8,
            }
            pub const deque___asan_annotation_type___asan_unposion:
                root::std::__1::deque___asan_annotation_type = 0;
            pub const deque___asan_annotation_type___asan_poison:
                root::std::__1::deque___asan_annotation_type = 0;
            pub type deque___asan_annotation_type = i32;
            pub const deque___asan_annotation_place___asan_front_moved:
                root::std::__1::deque___asan_annotation_place = 0;
            pub const deque___asan_annotation_place___asan_back_moved:
                root::std::__1::deque___asan_annotation_place = 0;
            pub type deque___asan_annotation_place = i32;
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct queue {
                pub _address: u8,
            }
            pub type queue_container_type = u8;
            pub type queue_value_type = u8;
            pub type queue_reference = u8;
            pub type queue_const_reference = u8;
            pub type queue_size_type = u8;
            #[repr(C)]
            #[repr(align(8))]
            #[derive(Debug, Copy, Clone)]
            pub struct thread {
                pub _bindgen_opaque_blob: u64,
            }
            pub type thread_id = u64;
            pub type thread_native_handle_type = u64;
            #[test]
            fn bindgen_test_layout_thread() {
                assert_eq!(
                    ::std::mem::size_of::<thread>(),
                    8usize,
                    concat!("Size of: ", stringify!(thread))
                );
                assert_eq!(
                    ::std::mem::align_of::<thread>(),
                    8usize,
                    concat!("Alignment of ", stringify!(thread))
                );
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16thread4joinEv"]
                pub fn thread_join(this: *mut root::std::__1::thread);
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16thread6detachEv"]
                pub fn thread_detach(this: *mut root::std::__1::thread);
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16thread20hardware_concurrencyEv"]
                pub fn thread_hardware_concurrency() -> ::std::os::raw::c_uint;
            }
            extern "C" {
                #[link_name = "\u{1}__ZNSt3__16threadD1Ev"]
                pub fn thread_thread_destructor(this: *mut root::std::__1::thread);
            }
            impl thread {
                #[inline]
                pub unsafe fn join(&mut self) {
                    thread_join(self)
                }
                #[inline]
                pub unsafe fn detach(&mut self) {
                    thread_detach(self)
                }
                #[inline]
                pub unsafe fn hardware_concurrency() -> ::std::os::raw::c_uint {
                    thread_hardware_concurrency()
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    thread_thread_destructor(self)
                }
            }
            pub mod __fs {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
            }
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct ThreadTask {
        pub thread: root::std::__1::thread,
        pub queue: [u64; 6usize],
        pub mtx: root::std::__1::mutex,
        pub cv: root::std::__1::condition_variable,
        pub complete: root::std::__1::condition_variable,
        pub running: bool,
    }
    #[test]
    fn bindgen_test_layout_ThreadTask() {
        const UNINIT: ::std::mem::MaybeUninit<ThreadTask> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ThreadTask>(),
            224usize,
            concat!("Size of: ", stringify!(ThreadTask))
        );
        assert_eq!(
            ::std::mem::align_of::<ThreadTask>(),
            8usize,
            concat!("Alignment of ", stringify!(ThreadTask))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).thread) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTask),
                "::",
                stringify!(thread)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).queue) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTask),
                "::",
                stringify!(queue)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mtx) as usize - ptr as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTask),
                "::",
                stringify!(mtx)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).cv) as usize - ptr as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTask),
                "::",
                stringify!(cv)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).complete) as usize - ptr as usize },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTask),
                "::",
                stringify!(complete)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).running) as usize - ptr as usize },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTask),
                "::",
                stringify!(running)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct ThreadTasks {
        pub numThreads: ::std::os::raw::c_int,
        pub tasks: *mut *mut root::ThreadTask,
    }
    #[test]
    fn bindgen_test_layout_ThreadTasks() {
        const UNINIT: ::std::mem::MaybeUninit<ThreadTasks> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ThreadTasks>(),
            16usize,
            concat!("Size of: ", stringify!(ThreadTasks))
        );
        assert_eq!(
            ::std::mem::align_of::<ThreadTasks>(),
            8usize,
            concat!("Alignment of ", stringify!(ThreadTasks))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).numThreads) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTasks),
                "::",
                stringify!(numThreads)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).tasks) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ThreadTasks),
                "::",
                stringify!(tasks)
            )
        );
    }
    pub const VMX_SLICE_HEIGHT: ::std::os::raw::c_int = 16;
    pub const VMX_QUALITY_COUNT: ::std::os::raw::c_int = 25;
    pub const VMX_MAX_PLANES: ::std::os::raw::c_int = 4;
    pub type buffer_t = ::std::os::raw::c_ulonglong;
    pub type BYTE = ::std::os::raw::c_uchar;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct VMX_SIZE {
        pub width: ::std::os::raw::c_int,
        pub height: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_VMX_SIZE() {
        const UNINIT: ::std::mem::MaybeUninit<VMX_SIZE> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<VMX_SIZE>(),
            8usize,
            concat!("Size of: ", stringify!(VMX_SIZE))
        );
        assert_eq!(
            ::std::mem::align_of::<VMX_SIZE>(),
            4usize,
            concat!("Alignment of ", stringify!(VMX_SIZE))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SIZE),
                "::",
                stringify!(width)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SIZE),
                "::",
                stringify!(height)
            )
        );
    }
    pub const VMX_FORMAT_VMX_FORMAT_PROGRESSIVE: root::VMX_FORMAT = 0;
    pub const VMX_FORMAT_VMX_FORMAT_INTERLACED: root::VMX_FORMAT = 1;
    pub type VMX_FORMAT = ::std::os::raw::c_uint;
    pub const VMX_ERR_VMX_ERR_OK: root::VMX_ERR = 0;
    pub const VMX_ERR_VMX_ERR_UNKNOWN: root::VMX_ERR = 1;
    pub const VMX_ERR_VMX_ERR_INVALID_CODEC_FORMAT: root::VMX_ERR = 2;
    pub const VMX_ERR_VMX_ERR_INVALID_SLICE_COUNT: root::VMX_ERR = 3;
    pub const VMX_ERR_VMX_ERR_BUFFER_OVERFLOW: root::VMX_ERR = 4;
    pub const VMX_ERR_VMX_ERR_INVALID_INSTANCE: root::VMX_ERR = 5;
    pub const VMX_ERR_VMX_ERR_INVALID_PARAMETERS: root::VMX_ERR = 6;
    pub type VMX_ERR = ::std::os::raw::c_uint;
    pub const VMX_PROFILE_VMX_PROFILE_DEFAULT: root::VMX_PROFILE = 0;
    pub const VMX_PROFILE_VMX_PROFILE_LQ: root::VMX_PROFILE = 33;
    pub const VMX_PROFILE_VMX_PROFILE_SQ: root::VMX_PROFILE = 66;
    pub const VMX_PROFILE_VMX_PROFILE_HQ: root::VMX_PROFILE = 99;
    pub const VMX_PROFILE_VMX_PROFILE_OMT_LQ: root::VMX_PROFILE = 133;
    pub const VMX_PROFILE_VMX_PROFILE_OMT_SQ: root::VMX_PROFILE = 166;
    pub const VMX_PROFILE_VMX_PROFILE_OMT_HQ: root::VMX_PROFILE = 199;
    pub type VMX_PROFILE = ::std::os::raw::c_uint;
    pub const VMX_COLORSPACE_VMX_COLORSPACE_UNDEFINED: root::VMX_COLORSPACE = 0;
    pub const VMX_COLORSPACE_VMX_COLORSPACE_BT601: root::VMX_COLORSPACE = 601;
    pub const VMX_COLORSPACE_VMX_COLORSPACE_BT709: root::VMX_COLORSPACE = 709;
    #[doc = " Defines currently supported color spaces used when converting between RGB and YUV\n Undefined = BT601 for SD (height < 720) and BT709 for HD (height >= 720)"]
    pub type VMX_COLORSPACE = ::std::os::raw::c_uint;
    pub const VMX_CODEC_FORMAT_VMX_CODEC_FORMAT_NONE: root::VMX_CODEC_FORMAT = 0;
    pub const VMX_CODEC_FORMAT_VMX_CODEC_FORMAT_PROGRESSIVE: root::VMX_CODEC_FORMAT = 1;
    pub const VMX_CODEC_FORMAT_VMX_CODEC_FORMAT_INTERLACED: root::VMX_CODEC_FORMAT = 2;
    pub const VMX_CODEC_FORMAT_VMX_CODEC_FORMAT_EXTENDED: root::VMX_CODEC_FORMAT = 3;
    pub type VMX_CODEC_FORMAT = ::std::os::raw::c_uint;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_UYVY: root::VMX_IMAGE_FORMAT = 0;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_YUY2: root::VMX_IMAGE_FORMAT = 1;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_NV12: root::VMX_IMAGE_FORMAT = 2;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_YV12: root::VMX_IMAGE_FORMAT = 3;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_YUVPLANAR422: root::VMX_IMAGE_FORMAT = 4;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_BGRA: root::VMX_IMAGE_FORMAT = 5;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_BGRX: root::VMX_IMAGE_FORMAT = 6;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_UYVA: root::VMX_IMAGE_FORMAT = 7;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_P216: root::VMX_IMAGE_FORMAT = 8;
    pub const VMX_IMAGE_FORMAT_VMX_IMAGE_PA16: root::VMX_IMAGE_FORMAT = 9;
    pub type VMX_IMAGE_FORMAT = ::std::os::raw::c_uint;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct VMX_SLICE_DATA {
        pub Stream: *mut ::std::os::raw::c_uchar,
        pub StreamPos: *mut ::std::os::raw::c_uchar,
        pub MaxStreamLength: ::std::os::raw::c_int,
        pub StreamLength: ::std::os::raw::c_int,
        pub BitsLeft: ::std::os::raw::c_int,
        pub Temp: root::buffer_t,
        pub TempRead: root::buffer_t,
        pub Size: [root::VMX_SIZE; 3usize],
    }
    #[test]
    fn bindgen_test_layout_VMX_SLICE_DATA() {
        const UNINIT: ::std::mem::MaybeUninit<VMX_SLICE_DATA> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<VMX_SLICE_DATA>(),
            72usize,
            concat!("Size of: ", stringify!(VMX_SLICE_DATA))
        );
        assert_eq!(
            ::std::mem::align_of::<VMX_SLICE_DATA>(),
            8usize,
            concat!("Alignment of ", stringify!(VMX_SLICE_DATA))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Stream) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(Stream)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).StreamPos) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(StreamPos)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).MaxStreamLength) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(MaxStreamLength)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).StreamLength) as usize - ptr as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(StreamLength)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).BitsLeft) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(BitsLeft)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Temp) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(Temp)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).TempRead) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(TempRead)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_DATA),
                "::",
                stringify!(Size)
            )
        );
    }
    #[repr(C)]
    #[repr(align(64))]
    #[derive(Debug, Copy, Clone)]
    pub struct VMX_SLICE_SET {
        pub DC: root::VMX_SLICE_DATA,
        pub AC: root::VMX_SLICE_DATA,
        pub Offset: [::std::os::raw::c_int; 4usize],
        pub Offset16: [::std::os::raw::c_int; 4usize],
        pub PixelSize: root::VMX_SIZE,
        pub PixelSizeInterlaced: root::VMX_SIZE,
        pub LowerField: ::std::os::raw::c_int,
        pub __bindgen_padding_0: [u16; 30usize],
        pub TempBlock: [::std::os::raw::c_short; 128usize],
        pub TempBlock2: [::std::os::raw::c_short; 128usize],
        pub TempBlock3: [::std::os::raw::c_short; 128usize],
    }
    #[test]
    fn bindgen_test_layout_VMX_SLICE_SET() {
        const UNINIT: ::std::mem::MaybeUninit<VMX_SLICE_SET> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<VMX_SLICE_SET>(),
            1024usize,
            concat!("Size of: ", stringify!(VMX_SLICE_SET))
        );
        assert_eq!(
            ::std::mem::align_of::<VMX_SLICE_SET>(),
            64usize,
            concat!("Alignment of ", stringify!(VMX_SLICE_SET))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).DC) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(DC)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).AC) as usize - ptr as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(AC)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Offset) as usize - ptr as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(Offset)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Offset16) as usize - ptr as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(Offset16)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).PixelSize) as usize - ptr as usize },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(PixelSize)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).PixelSizeInterlaced) as usize - ptr as usize },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(PixelSizeInterlaced)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).LowerField) as usize - ptr as usize },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(LowerField)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).TempBlock) as usize - ptr as usize },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(TempBlock)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).TempBlock2) as usize - ptr as usize },
            512usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(TempBlock2)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).TempBlock3) as usize - ptr as usize },
            768usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_SLICE_SET),
                "::",
                stringify!(TempBlock3)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct VMX_PLANE {
        pub Index: ::std::os::raw::c_int,
        pub Size: root::VMX_SIZE,
        pub Stride: ::std::os::raw::c_int,
        pub Data: *mut root::BYTE,
        pub DataLowerPreview: *mut root::BYTE,
    }
    #[test]
    fn bindgen_test_layout_VMX_PLANE() {
        const UNINIT: ::std::mem::MaybeUninit<VMX_PLANE> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<VMX_PLANE>(),
            32usize,
            concat!("Size of: ", stringify!(VMX_PLANE))
        );
        assert_eq!(
            ::std::mem::align_of::<VMX_PLANE>(),
            8usize,
            concat!("Alignment of ", stringify!(VMX_PLANE))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Index) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_PLANE),
                "::",
                stringify!(Index)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_PLANE),
                "::",
                stringify!(Size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Stride) as usize - ptr as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_PLANE),
                "::",
                stringify!(Stride)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_PLANE),
                "::",
                stringify!(Data)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).DataLowerPreview) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_PLANE),
                "::",
                stringify!(DataLowerPreview)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct VMX_INSTANCE {
        pub avx2: ::std::os::raw::c_int,
        pub Format: root::VMX_FORMAT,
        pub Profile: root::VMX_PROFILE,
        pub ColorSpace: root::VMX_COLORSPACE,
        pub Quality: ::std::os::raw::c_int,
        pub MinQuality: ::std::os::raw::c_int,
        pub DCShift: ::std::os::raw::c_int,
        pub DecodeQualityPresets: [*mut ::std::os::raw::c_ushort; 25usize],
        pub EncodeQualityPresets: [*mut ::std::os::raw::c_ushort; 25usize],
        pub DecodeMatrix: *mut ::std::os::raw::c_ushort,
        pub EncodeMatrix: *mut ::std::os::raw::c_ushort,
        pub DecodeQualityPresets256: [*mut ::std::os::raw::c_ushort; 25usize],
        pub EncodeQualityPresets256: [*mut ::std::os::raw::c_ushort; 25usize],
        pub DecodeMatrix256: *mut ::std::os::raw::c_ushort,
        pub EncodeMatrix256: *mut ::std::os::raw::c_ushort,
        pub Planes: [root::VMX_PLANE; 4usize],
        pub SliceCount: ::std::os::raw::c_int,
        pub AlignedHeight: ::std::os::raw::c_int,
        pub Slices: *mut *mut root::VMX_SLICE_SET,
        pub TargetBytesPerFrameMin: ::std::os::raw::c_int,
        pub TargetBytesPerFrameMax: ::std::os::raw::c_int,
        pub Threads: ::std::os::raw::c_int,
        pub Tasks: *mut root::ThreadTasks,
        pub PreviewSize: root::VMX_SIZE,
        pub PreviewSizeInterlaced: root::VMX_SIZE,
        pub ImageData: *mut root::BYTE,
        pub ImageStride: ::std::os::raw::c_int,
        pub ImageDataU: *mut root::BYTE,
        pub ImageStrideU: ::std::os::raw::c_int,
        pub ImageDataV: *mut root::BYTE,
        pub ImageStrideV: ::std::os::raw::c_int,
        pub ImageDataA: *mut root::BYTE,
        pub ImageStrideA: ::std::os::raw::c_int,
        pub ImageFormat: root::VMX_IMAGE_FORMAT,
    }
    #[test]
    fn bindgen_test_layout_VMX_INSTANCE() {
        const UNINIT: ::std::mem::MaybeUninit<VMX_INSTANCE> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<VMX_INSTANCE>(),
            1112usize,
            concat!("Size of: ", stringify!(VMX_INSTANCE))
        );
        assert_eq!(
            ::std::mem::align_of::<VMX_INSTANCE>(),
            8usize,
            concat!("Alignment of ", stringify!(VMX_INSTANCE))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).avx2) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(avx2)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Format) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(Format)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Profile) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(Profile)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ColorSpace) as usize - ptr as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ColorSpace)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Quality) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(Quality)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).MinQuality) as usize - ptr as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(MinQuality)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).DCShift) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(DCShift)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).DecodeQualityPresets) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(DecodeQualityPresets)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).EncodeQualityPresets) as usize - ptr as usize },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(EncodeQualityPresets)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).DecodeMatrix) as usize - ptr as usize },
            432usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(DecodeMatrix)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).EncodeMatrix) as usize - ptr as usize },
            440usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(EncodeMatrix)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).DecodeQualityPresets256) as usize - ptr as usize },
            448usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(DecodeQualityPresets256)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).EncodeQualityPresets256) as usize - ptr as usize },
            648usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(EncodeQualityPresets256)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).DecodeMatrix256) as usize - ptr as usize },
            848usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(DecodeMatrix256)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).EncodeMatrix256) as usize - ptr as usize },
            856usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(EncodeMatrix256)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Planes) as usize - ptr as usize },
            864usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(Planes)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).SliceCount) as usize - ptr as usize },
            992usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(SliceCount)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).AlignedHeight) as usize - ptr as usize },
            996usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(AlignedHeight)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Slices) as usize - ptr as usize },
            1000usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(Slices)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).TargetBytesPerFrameMin) as usize - ptr as usize },
            1008usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(TargetBytesPerFrameMin)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).TargetBytesPerFrameMax) as usize - ptr as usize },
            1012usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(TargetBytesPerFrameMax)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Threads) as usize - ptr as usize },
            1016usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(Threads)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).Tasks) as usize - ptr as usize },
            1024usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(Tasks)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).PreviewSize) as usize - ptr as usize },
            1032usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(PreviewSize)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).PreviewSizeInterlaced) as usize - ptr as usize },
            1040usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(PreviewSizeInterlaced)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageData) as usize - ptr as usize },
            1048usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageData)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageStride) as usize - ptr as usize },
            1056usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageStride)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageDataU) as usize - ptr as usize },
            1064usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageDataU)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageStrideU) as usize - ptr as usize },
            1072usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageStrideU)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageDataV) as usize - ptr as usize },
            1080usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageDataV)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageStrideV) as usize - ptr as usize },
            1088usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageStrideV)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageDataA) as usize - ptr as usize },
            1096usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageDataA)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageStrideA) as usize - ptr as usize },
            1104usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageStrideA)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ImageFormat) as usize - ptr as usize },
            1108usize,
            concat!(
                "Offset of field: ",
                stringify!(VMX_INSTANCE),
                "::",
                stringify!(ImageFormat)
            )
        );
    }
    pub const VMX_DECODE_MATRIX_COUNT: ::std::os::raw::c_int = 64;
    pub const VMX_ENCODE_MATRIX_COUNT: ::std::os::raw::c_int = 192;
    extern "C" {
        #[doc = " Create a new instance of the codec.\n @param[in] dimensions The pixel size of the image. Supports a minimum dimension of 16x16 and a maximum of 7680x4320 (8K).\n @param[in] profile Select a profile to use when encoding.\n @param[in] colorSpace Specify the color space to use when converting between RGB and YUV. Default is BT709."]
        pub fn VMX_Create(
            dimensions: root::VMX_SIZE,
            profile: root::VMX_PROFILE,
            colorSpace: root::VMX_COLORSPACE,
        ) -> *mut root::VMX_INSTANCE;
    }
    extern "C" {
        #[doc = " Destroy and free up memory of instance created with VMX_Create"]
